{
  "[AGENT]": 52003,
  "[ALERT]": 52001,
  "[DATA]": 52007,
  "[DSTIP]": 52009,
  "[FILE]": 52012,
  "[GROUP]": 52015,
  "[LEVEL]": 52006,
  "[MITRE]": 52004,
  "[PORT]": 52010,
  "[PROCESS]": 52013,
  "[RULE]": 52002,
  "[SEVERITY]": 52014,
  "[SRCIP]": 52008,
  "[TIME]": 52005,
  "[USER]": 52011,
  "[SIEM]": 52000
}
