{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": true,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "RobertaProcessing",
    "sep": [
      "</s>",
      2
    ],
    "cls": [
      "<s>",
      0
    ],
    "trim_offsets": true,
    "add_prefix_space": false
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": "",
    "end_of_word_suffix": "",
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<s>": 0,
      "<pad>": 1,
      "</s>": 2,
      "<unk>": 3,
      "<mask>": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "A": 37,
      "B": 38,
      "C": 39,
      "D": 40,
      "E": 41,
      "F": 42,
      "G": 43,
      "H": 44,
      "I": 45,
      "J": 46,
      "K": 47,
      "L": 48,
      "M": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "Q": 53,
      "R": 54,
      "S": 55,
      "T": 56,
      "U": 57,
      "V": 58,
      "W": 59,
      "X": 60,
      "Y": 61,
      "Z": 62,
      "[": 63,
      "\\": 64,
      "]": 65,
      "^": 66,
      "_": 67,
      "`": 68,
      "a": 69,
      "b": 70,
      "c": 71,
      "d": 72,
      "e": 73,
      "f": 74,
      "g": 75,
      "h": 76,
      "i": 77,
      "j": 78,
      "k": 79,
      "l": 80,
      "m": 81,
      "n": 82,
      "o": 83,
      "p": 84,
      "q": 85,
      "r": 86,
      "s": 87,
      "t": 88,
      "u": 89,
      "v": 90,
      "w": 91,
      "x": 92,
      "y": 93,
      "z": 94,
      "{": 95,
      "|": 96,
      "}": 97,
      "~": 98,
      "¡": 99,
      "¢": 100,
      "£": 101,
      "¤": 102,
      "¥": 103,
      "¦": 104,
      "§": 105,
      "¨": 106,
      "©": 107,
      "ª": 108,
      "«": 109,
      "¬": 110,
      "®": 111,
      "¯": 112,
      "°": 113,
      "±": 114,
      "²": 115,
      "³": 116,
      "´": 117,
      "µ": 118,
      "¶": 119,
      "·": 120,
      "¸": 121,
      "¹": 122,
      "º": 123,
      "»": 124,
      "¼": 125,
      "½": 126,
      "¾": 127,
      "¿": 128,
      "À": 129,
      "Á": 130,
      "Â": 131,
      "Ã": 132,
      "Ä": 133,
      "Å": 134,
      "Æ": 135,
      "Ç": 136,
      "È": 137,
      "É": 138,
      "Ê": 139,
      "Ë": 140,
      "Ì": 141,
      "Í": 142,
      "Î": 143,
      "Ï": 144,
      "Ð": 145,
      "Ñ": 146,
      "Ò": 147,
      "Ó": 148,
      "Ô": 149,
      "Õ": 150,
      "Ö": 151,
      "×": 152,
      "Ø": 153,
      "Ù": 154,
      "Ú": 155,
      "Û": 156,
      "Ü": 157,
      "Ý": 158,
      "Þ": 159,
      "ß": 160,
      "à": 161,
      "á": 162,
      "â": 163,
      "ã": 164,
      "ä": 165,
      "å": 166,
      "æ": 167,
      "ç": 168,
      "è": 169,
      "é": 170,
      "ê": 171,
      "ë": 172,
      "ì": 173,
      "í": 174,
      "î": 175,
      "ï": 176,
      "ð": 177,
      "ñ": 178,
      "ò": 179,
      "ó": 180,
      "ô": 181,
      "õ": 182,
      "ö": 183,
      "÷": 184,
      "ø": 185,
      "ù": 186,
      "ú": 187,
      "û": 188,
      "ü": 189,
      "ý": 190,
      "þ": 191,
      "ÿ": 192,
      "Ā": 193,
      "ā": 194,
      "Ă": 195,
      "ă": 196,
      "Ą": 197,
      "ą": 198,
      "Ć": 199,
      "ć": 200,
      "Ĉ": 201,
      "ĉ": 202,
      "Ċ": 203,
      "ċ": 204,
      "Č": 205,
      "č": 206,
      "Ď": 207,
      "ď": 208,
      "Đ": 209,
      "đ": 210,
      "Ē": 211,
      "ē": 212,
      "Ĕ": 213,
      "ĕ": 214,
      "Ė": 215,
      "ė": 216,
      "Ę": 217,
      "ę": 218,
      "Ě": 219,
      "ě": 220,
      "Ĝ": 221,
      "ĝ": 222,
      "Ğ": 223,
      "ğ": 224,
      "Ġ": 225,
      "ġ": 226,
      "Ģ": 227,
      "ģ": 228,
      "Ĥ": 229,
      "ĥ": 230,
      "Ħ": 231,
      "ħ": 232,
      "Ĩ": 233,
      "ĩ": 234,
      "Ī": 235,
      "ī": 236,
      "Ĭ": 237,
      "ĭ": 238,
      "Į": 239,
      "į": 240,
      "İ": 241,
      "ı": 242,
      "Ĳ": 243,
      "ĳ": 244,
      "Ĵ": 245,
      "ĵ": 246,
      "Ķ": 247,
      "ķ": 248,
      "ĸ": 249,
      "Ĺ": 250,
      "ĺ": 251,
      "Ļ": 252,
      "ļ": 253,
      "Ľ": 254,
      "ľ": 255,
      "Ŀ": 256,
      "ŀ": 257,
      "Ł": 258,
      "ł": 259,
      "Ń": 260,
      "Ġt": 261,
      "Ġa": 262,
      "in": 263,
      "er": 264,
      "Ġth": 265,
      "on": 266,
      "re": 267,
      "Ġc": 268,
      "Ġthe": 269,
      "at": 270,
      "Ġo": 271,
      "Ġs": 272,
      "ed": 273,
      "it": 274,
      "en": 275,
      "es": 276,
      "or": 277,
      "Ġin": 278,
      "is": 279,
      "nd": 280,
      "Ġb": 281,
      "al": 282,
      "Ġw": 283,
      "Ġf": 284,
      "ion": 285,
      "Ġp": 286,
      "Ġd": 287,
      "Ġto": 288,
      "ic": 289,
      "ec": 290,
      "ing": 291,
      "ro": 292,
      "ar": 293,
      "il": 294,
      "us": 295,
      "Ġm": 296,
      "Ġand": 297,
      "an": 298,
      "Ġof": 299,
      "ent": 300,
      "ac": 301,
      "et": 302,
      "om": 303,
      "as": 304,
      "Ġv": 305,
      "Ġre": 306,
      "lo": 307,
      "le": 308,
      "ers": 309,
      "Ġh": 310,
      "ĠT": 311,
      "te": 312,
      "Ġe": 313,
      "ation": 314,
      "ĠS": 315,
      "ul": 316,
      "ĠC": 317,
      "Ġn": 318,
      "âĢ": 319,
      "ly": 320,
      "am": 321,
      "20": 322,
      "ut": 323,
      "Ġbe": 324,
      "un": 325,
      "he": 326,
      "Ġus": 327,
      "ĠA": 328,
      "ack": 329,
      "ect": 330,
      "ve": 331,
      "ur": 332,
      "Ġ(": 333,
      "ab": 334,
      "ri": 335,
      "Ġis": 336,
      "ity": 337,
      "ct": 338,
      "201": 339,
      "ver": 340,
      "Ġcon": 341,
      "Ġat": 342,
      "ĠI": 343,
      "im": 344,
      "st": 345,
      "id": 346,
      "Ġcom": 347,
      "ad": 348,
      "ig": 349,
      "ow": 350,
      "Ġthat": 351,
      "ot": 352,
      "Ġon": 353,
      "od": 354,
      "if": 355,
      "Ġan": 356,
      "ain": 357,
      "ore": 358,
      "ĠM": 359,
      "Ġl": 360,
      "Ġex": 361,
      "ol": 362,
      "Ġfor": 363,
      "Ġ1": 364,
      "Ġwh": 365,
      "ag": 366,
      "ith": 367,
      "ter": 368,
      "Ġatt": 369,
      "Ġor": 370,
      "are": 371,
      "pt": 372,
      "ce": 373,
      "Ġg": 374,
      "Ġpro": 375,
      "ĠP": 376,
      "Ġas": 377,
      "ess": 378,
      "ate": 379,
      "VE": 380,
      "ĠThe": 381,
      "Ġwith": 382,
      "ĠW": 383,
      "se": 384,
      "ment": 385,
      "ia": 386,
      "Ġattack": 387,
      "Ġal": 388,
      "ĠD": 389,
      "ch": 390,
      "ir": 391,
      "tr": 392,
      "Ġby": 393,
      "ay": 394,
      "pp": 395,
      "Ġwe": 396,
      "ile": 397,
      "ĠR": 398,
      "rom": 399,
      "ĠF": 400,
      "abil": 401,
      "ws": 402,
      "ware": 403,
      "ner": 404,
      "Ġser": 405,
      "Ġit": 406,
      "Ġcomp": 407,
      "ial": 408,
      "ĠU": 409,
      "Ġ.": 410,
      "ary": 411,
      "ated": 412,
      "and": 413,
      "ulner": 414,
      "CVE": 415,
      "ĠâĢ": 416,
      "ke": 417,
      "est": 418,
      "th": 419,
      "ss": 420,
      "ulnerabil": 421,
      "el": 422,
      "up": 423,
      "ys": 424,
      "so": 425,
      "fore": 426,
      "ĠE": 427,
      "Ġvia": 428,
      "00": 429,
      "Ġinf": 430,
      "orm": 431,
      "Ġmal": 432,
      "Ġbefore": 433,
      "ies": 434,
      "ĠO": 435,
      "Ġcont": 436,
      "qu": 437,
      "ist": 438,
      "ure": 439,
      "per": 440,
      "Ġthis": 441,
      "Ġad": 442,
      "age": 443,
      "ort": 444,
      "Ġare": 445,
      "âĢĻ": 446,
      "Ġst": 447,
      "ft": 448,
      "ĠH": 449,
      "ail": 450,
      "ug": 451,
      "Ġfrom": 452,
      "ll": 453,
      "tem": 454,
      "Ġck": 455,
      "Ġote": 456,
      "Ġows": 457,
      "ode": 458,
      "ĠIn": 459,
      "Ġnot": 460,
      "ĠB": 461,
      "ere": 462,
      "ĠN": 463,
      "ich": 464,
      "cc": 465,
      "Ġvulnerabil": 466,
      "Ġde": 467,
      "Ġun": 468,
      "ave": 469,
      "vic": 470,
      "ive": 471,
      "ber": 472,
      "low": 473,
      "Ġwhich": 474,
      "Ġ2": 475,
      "Ġckers": 476,
      "ĠG": 477,
      "ors": 478,
      "oc": 479,
      "Ġlo": 480,
      "arg": 481,
      "Ġr": 482,
      "Ġen": 483,
      "ff": 484,
      "iv": 485,
      "ork": 486,
      "his": 487,
      "ire": 488,
      "amp": 489,
      "Ġ201": 490,
      "ame": 491,
      "Ġused": 492,
      "sp": 493,
      "Ġsu": 494,
      "ind": 495,
      "Ġco": 496,
      "Ġcomm": 497,
      "Ġmalware": 498,
      "âĢĿ": 499,
      "Ġhave": 500,
      "Ġfile": 501,
      "ĠL": 502,
      "own": 503,
      "Ġwas": 504,
      "Ġact": 505,
      "all": 506,
      "ystem": 507,
      "ign": 508,
      "ous": 509,
      "ra": 510,
      "uld": 511,
      "Ġsp": 512,
      "ied": 513,
      "The": 514,
      "ost": 515,
      "und": 516,
      "act": 517,
      "ations": 518,
      "Ġ3": 519,
      "art": 520,
      "arget": 521,
      "plo": 522,
      "ions": 523,
      "rary": 524,
      "ĠâĢľ": 525,
      "ata": 526,
      "lic": 527,
      "ite": 528,
      "um": 529,
      "ill": 530,
      "Ġcode": 531,
      "ud": 532,
      "ant": 533,
      "Ġvulnerability": 534,
      "ormation": 535,
      "cri": 536,
      "vice": 537,
      "Ġbit": 538,
      "Ġhas": 539,
      "able": 540,
      "Ġse": 541,
      "iz": 542,
      "etw": 543,
      "Ġtarget": 544,
      "Ġweb": 545,
      "ified": 546,
      "ib": 547,
      "ecur": 548,
      "end": 549,
      "ecurity": 550,
      "Ġbitrary": 551,
      "Ġinformation": 552,
      "ther": 553,
      "Ġ\"": 554,
      "ew": 555,
      "ex": 556,
      "Ġacc": 557,
      "ows": 558,
      "Ġim": 559,
      "ry": 560,
      "Ġsystem": 561,
      "ute": 562,
      "Ġinc": 563,
      "Ġ0": 564,
      "ious": 565,
      "Ġch": 566,
      "Ġdata": 567,
      "Ġadd": 568,
      "em": 569,
      "li": 570,
      "Ġsh": 571,
      "Ġem": 572,
      "ord": 573,
      "Ġapp": 574,
      "ult": 575,
      "Ġob": 576,
      "ĠJ": 577,
      "ht": 578,
      "load": 579,
      "ip": 580,
      "Ġca": 581,
      "ection": 582,
      "uct": 583,
      "ical": 584,
      "Ġle": 585,
      "port": 586,
      "fer": 587,
      "Ġpo": 588,
      "ass": 589,
      "Ġ6": 590,
      "cript": 591,
      "ear": 592,
      "ident": 593,
      "ak": 594,
      "ress": 595,
      "ence": 596,
      "ust": 597,
      "Ġdis": 598,
      "ĠV": 599,
      "ine": 600,
      "ict": 601,
      "ph": 602,
      "ploit": 603,
      "Ġfil": 604,
      "etwork": 605,
      "Ġso": 606,
      "indows": 607,
      "ected": 608,
      "tern": 609,
      "ach": 610,
      "Ġ4": 611,
      "ory": 612,
      "Ġuser": 613,
      "ities": 614,
      "reat": 615,
      "ugh": 616,
      "Ġalso": 617,
      "Ġusers": 618,
      "Ġother": 619,
      "roup": 620,
      "Ġ00": 621,
      "use": 622,
      "Ġservice": 623,
      "ĠK": 624,
      "ecute": 625,
      "Ġexploit": 626,
      "kn": 627,
      "Ġdo": 628,
      "unt": 629,
      "ang": 630,
      "2012": 631,
      "Ġ5": 632,
      "Ġab": 633,
      "Ġpre": 634,
      "co": 635,
      "ĠWindows": 636,
      "com": 637,
      "Ġx": 638,
      "Ġcommand": 639,
      "yber": 640,
      "2010": 641,
      "Ġind": 642,
      "unct": 643,
      "Ġcan": 644,
      "ub": 645,
      "Ġattacks": 646,
      "irect": 647,
      "ase": 648,
      "Ġdet": 649,
      "ue": 650,
      "uth": 651,
      "Ġmod": 652,
      "ĠThis": 653,
      "Ġoper": 654,
      "pl": 655,
      "ĠCh": 656,
      "Ġbeen": 657,
      "Ġfiles": 658,
      "Ġwere": 659,
      "Ġ7": 660,
      "Ġup": 661,
      "vers": 662,
      "ecified": 663,
      "Ġtheir": 664,
      "min": 665,
      "rypt": 666,
      "to": 667,
      "ans": 668,
      "Ġfunct": 669,
      "Ġconf": 670,
      "oo": 671,
      "Ġy": 672,
      "Ġstr": 673,
      "ime": 674,
      "Ġthese": 675,
      "ens": 676,
      "ome": 677,
      "Ġnetwork": 678,
      "ech": 679,
      "ject": 680,
      "ument": 681,
      "her": 682,
      "2011": 683,
      "Ġserver": 684,
      "rig": 685,
      "Ġcould": 686,
      "Ġover": 687,
      "ecut": 688,
      "Ġgroup": 689,
      "ectors": 690,
      "Ġscript": 691,
      "eb": 692,
      "arch": 693,
      "ved": 694,
      "Ġtr": 695,
      "ased": 696,
      "Ġ8": 697,
      "ard": 698,
      "specified": 699,
      "lud": 700,
      "Ġxecute": 701,
      "Ġinst": 702,
      "ĠTh": 703,
      "tain": 704,
      "Ġfol": 705,
      "cess": 706,
      "Ġsecurity": 707,
      "Ġrel": 708,
      "ong": 709,
      "Ġ20": 710,
      "ser": 711,
      "Ġar": 712,
      "ĠUn": 713,
      "known": 714,
      "raft": 715,
      "ide": 716,
      "Ġcontain": 717,
      "icro": 718,
      "Ġattacker": 719,
      "ual": 720,
      "ific": 721,
      "av": 722,
      "Ġ,": 723,
      "Ġvectors": 724,
      "Ġusing": 725,
      "Ġ10": 726,
      "Ġuse": 727,
      "out": 728,
      "Ġexecut": 729,
      "Ġcraft": 730,
      "ates": 731,
      "ĠCVE": 732,
      "rough": 733,
      "Ġits": 734,
      "ional": 735,
      "Ġdif": 736,
      "Ġcrafted": 737,
      "Ġreg": 738,
      "ian": 739,
      "Ġinclud": 740,
      "ocument": 741,
      "ap": 742,
      "Ġemail": 743,
      "ast": 744,
      "ictim": 745,
      "Ġden": 746,
      "Ġpri": 747,
      "do": 748,
      "Ġcause": 749,
      "ĠHT": 750,
      "Ġwill": 751,
      "Ġimp": 752,
      "ould": 753,
      "ks": 754,
      "int": 755,
      "site": 756,
      "Ġthrough": 757,
      "Ġpar": 758,
      "omain": 759,
      "Ġvictim": 760,
      "istr": 761,
      "Ġthey": 762,
      "rol": 763,
      "Ġone": 764,
      "Ġcre": 765,
      "ĠX": 766,
      "Ġdenial": 767,
      "quest": 768,
      "les": 769,
      "Ġke": 770,
      "Ġpart": 771,
      "Ġspec": 772,
      "ĠAP": 773,
      "nt": 774,
      "log": 775,
      "soft": 776,
      "any": 777,
      "'s": 778,
      "Ġpl": 779,
      "Ġcyber": 780,
      "ĠMicro": 781,
      "Ġaddress": 782,
      "Ġdiffer": 783,
      "Ġ-": 784,
      "ras": 785,
      "Ġreport": 786,
      "os": 787,
      "Ġdocument": 788,
      "Ġback": 789,
      "aign": 790,
      "ampaign": 791,
      "echn": 792,
      "Ġdec": 793,
      "ĠSer": 794,
      "ĠEx": 795,
      "Ġag": 796,
      "Ġper": 797,
      "Ġev": 798,
      "Ġattackers": 799,
      "ĠSt": 800,
      "ound": 801,
      "ake": 802,
      "Ġany": 803,
      "Ġfir": 804,
      "Ġfollow": 805,
      "Ġdoes": 806,
      "ount": 807,
      "Ġdirect": 808,
      "icious": 809,
      "ari": 810,
      "Ġvers": 811,
      "Ġsamp": 812,
      "Ġ200": 813,
      "Ġinv": 814,
      "op": 815,
      "cal": 816,
      "Ġinter": 817,
      "Ġallow": 818,
      "Ġident": 819,
      "uss": 820,
      "ote": 821,
      "Ġaccess": 822,
      "Ġdomain": 823,
      "Ġall": 824,
      "10": 825,
      "Ġenc": 826,
      "one": 827,
      "Ġtool": 828,
      "Ġdes": 829,
      "gr": 830,
      "Ġcampaign": 831,
      "gan": 832,
      "Ġbut": 833,
      "lication": 834,
      "Ġgo": 835,
      "Ġrem": 836,
      "Ġrelated": 837,
      "ese": 838,
      "AT": 839,
      "Ġdifferent": 840,
      "Ġthreat": 841,
      "amet": 842,
      "ike": 843,
      "ĠRe": 844,
      "ĠMicrosoft": 845,
      "ise": 846,
      "yp": 847,
      "onent": 848,
      "32": 849,
      "Ġprov": 850,
      "Ġsome": 851,
      "ssib": 852,
      "Ġval": 853,
      "php": 854,
      "Ġout": 855,
      "ĠĠ": 856,
      "Ġparamet": 857,
      "Ġmore": 858,
      "Ġnew": 859,
      "Ġlog": 860,
      "form": 861,
      "Ġthan": 862,
      "ond": 863,
      "..": 864,
      "ight": 865,
      "Ġpay": 866,
      "Ġtime": 867,
      "our": 868,
      "Ġcomponent": 869,
      "Ġpat": 870,
      "Ġpossib": 871,
      "Ġmay": 872,
      "ace": 873,
      "ĠSP": 874,
      "Ġanal": 875,
      "Ġmalicious": 876,
      "Ġcomput": 877,
      "Ġinto": 878,
      "Ġsc": 879,
      "wo": 880,
      "Ġhe": 881,
      "11": 882,
      "Ġwho": 883,
      "Ġnum": 884,
      "ink": 885,
      "Ġ9": 886,
      "ever": 887,
      "Ġprocess": 888,
      "Ġsame": 889,
      "Ġcomprom": 890,
      "Ġlike": 891,
      "Ġhost": 892,
      "Ġfunction": 893,
      "Ġconn": 894,
      ").": 895,
      "fter": 896,
      "hing": 897,
      "Ġwhen": 898,
      "ternet": 899,
      "ross": 900,
      "Ġrec": 901,
      "Ġdown": 902,
      "ĠCom": 903,
      "exe": 904,
      "Ġfollowing": 905,
      "Ġactiv": 906,
      "Ġmess": 907,
      "Ġkey": 908,
      "ule": 909,
      "Ġtechn": 910,
      "Ġsuch": 911,
      "ru": 912,
      "Ġinstall": 913,
      "ating": 914,
      "ces": 915,
      "Ġrun": 916,
      "Ġthem": 917,
      "Ġcontrol": 918,
      "SS": 919,
      "ance": 920,
      "Ġunspecified": 921,
      "Ġwould": 922,
      "ĠIP": 923,
      "Ġvulnerabilities": 924,
      "12": 925,
      "Ġinte": 926,
      "Ġcall": 927,
      "ree": 928,
      "entic": 929,
      "unic": 930,
      "duct": 931,
      "Ġsim": 932,
      "ĠChin": 933,
      "Ġaff": 934,
      "Ġpub": 935,
      "Ġconfig": 936,
      "urre": 937,
      "uthentic": 938,
      "ML": 939,
      "search": 940,
      "Ġtwo": 941,
      "TP": 942,
      "Ġ'": 943,
      "Ġname": 944,
      "Ġres": 945,
      "Ġorgan": 946,
      "der": 947,
      "ential": 948,
      "Ġproper": 949,
      "ok": 950,
      "Ġpriv": 951,
      "Ġfirst": 952,
      "Ġfound": 953,
      "ites": 954,
      "Ġ11": 955,
      "ont": 956,
      "ĠAn": 957,
      "str": 958,
      "Ġparameter": 959,
      "ning": 960,
      "vices": 961,
      "Ġservers": 962,
      "Ġthen": 963,
      "ultip": 964,
      "ulnerability": 965,
      "pen": 966,
      "Ġlist": 967,
      "ĠRuss": 968,
      "Ġif": 969,
      "Ġsa": 970,
      "Ġaccount": 971,
      "ucture": 972,
      "Ġset": 973,
      "Ġk": 974,
      "Ġdef": 975,
      "ffic": 976,
      "Ġpass": 977,
      "ep": 978,
      "ĠAPT": 979,
      "ption": 980,
      "Ġbu": 981,
      "ised": 982,
      "Ġtargeted": 983,
      "date": 984,
      "ftware": 985,
      "Ġnam": 986,
      "ĠWeb": 987,
      "word": 988,
      "ĠIt": 989,
      "Ġrequest": 990,
      "ultiple": 991,
      "ments": 992,
      "tt": 993,
      "Ġresp": 994,
      "ings": 995,
      "Ġencrypt": 996,
      "Ġresearch": 997,
      "Ġvari": 998,
      "Ġwork": 999,
      "Ġcor": 1000,
      "ically": 1001,
      "Ġav": 1002,
      "vern": 1003,
      "nel": 1004,
      "ĠInternet": 1005,
      "Ġcommands": 1006,
      "ĠApp": 1007,
      "ish": 1008,
      "ced": 1009,
      "Ġcer": 1010,
      "TE": 1011,
      "Ġmodule": 1012,
      "),": 1013,
      "ĠâĢĵ": 1014,
      "Ġorganiz": 1015,
      "ages": 1016,
      "2013": 1017,
      "Ġobtain": 1018,
      "ful": 1019,
      "Ġcontent": 1020,
      "In": 1021,
      "Ġdel": 1022,
      "rib": 1023,
      "Ġunknown": 1024,
      "read": 1025,
      "Ġsystems": 1026,
      "ener": 1027,
      "la": 1028,
      "Ġprev": 1029,
      "Ġsign": 1030,
      "ĠâĢĺ": 1031,
      "Ġ;": 1032,
      "ysis": 1033,
      "Ġsub": 1034,
      "Ġro": 1035,
      "This": 1036,
      "Ġdownload": 1037,
      "15": 1038,
      "Ġent": 1039,
      "LL": 1040,
      "ify": 1041,
      "QL": 1042,
      "Ġhack": 1043,
      "ger": 1044,
      "Ġonly": 1045,
      "Ġagain": 1046,
      "owever": 1047,
      "Ġj": 1048,
      "ĠWh": 1049,
      "Ġcommunic": 1050,
      "right": 1051,
      "hell": 1052,
      "ix": 1053,
      "ĠServer": 1054,
      "pr": 1055,
      "cover": 1056,
      "Ġnumber": 1057,
      "be": 1058,
      "Ġman": 1059,
      "net": 1060,
      "ccess": 1061,
      "served": 1062,
      "iew": 1063,
      "Ġabout": 1064,
      "ux": 1065,
      "urrent": 1066,
      "iqu": 1067,
      "esp": 1068,
      "uring": 1069,
      "lier": 1070,
      "velo": 1071,
      "Ġhand": 1072,
      "Ġbot": 1073,
      "Ġproperly": 1074,
      "Ġprovid": 1075,
      "ove": 1076,
      "Ġdetail": 1077,
      "ï¿": 1078,
      "Ġtyp": 1079,
      "Ġpayload": 1080,
      "hishing": 1081,
      "ï¿½": 1082,
      "ĠOr": 1083,
      "ons": 1084,
      "Ġour": 1085,
      "ears": 1086,
      "ĠPro": 1087,
      "rit": 1088,
      "Ġprot": 1089,
      "Ġ/": 1090,
      "itional": 1091,
      "Ġversion": 1092,
      "ition": 1093,
      "Ġmost": 1094,
      "Ġsec": 1095,
      "ĠHTML": 1096,
      "Ġmet": 1097,
      "roj": 1098,
      "ature": 1099,
      "igh": 1100,
      "64": 1101,
      "ational": 1102,
      "Ġadmin": 1103,
      "ĠEn": 1104,
      "loc": 1105,
      "vernment": 1106,
      "ox": 1107,
      "Ġdro": 1108,
      "Ġsoftware": 1109,
      "iss": 1110,
      "Ġne": 1111,
      "uration": 1112,
      "led": 1113,
      "Ġpers": 1114,
      "Ġloc": 1115,
      "Ġoff": 1116,
      "ustom": 1117,
      "Ġhad": 1118,
      "Ġdri": 1119,
      "Ġtools": 1120,
      "Ġsamples": 1121,
      "Ġinject": 1122,
      "Ġread": 1123,
      "18": 1124,
      "13": 1125,
      "ose": 1126,
      "gle": 1127,
      "ĠSQL": 1128,
      "Ġindic": 1129,
      "Ġuthentic": 1130,
      "ange": 1131,
      "Ġcons": 1132,
      "ĠSecurity": 1133,
      "Ġdevelo": 1134,
      "Ġwell": 1135,
      "door": 1136,
      "Ġund": 1137,
      "ffer": 1138,
      "ou": 1139,
      "Ġpassword": 1140,
      "ular": 1141,
      "Ġwithin": 1142,
      "ays": 1143,
      "ld": 1144,
      "oogle": 1145,
      "gram": 1146,
      "Ġ2014": 1147,
      "Ġtargets": 1148,
      "16": 1149,
      "ially": 1150,
      "Ġlink": 1151,
      "bed": 1152,
      "Ġcompromised": 1153,
      "Ġagainst": 1154,
      "ince": 1155,
      "ov": 1156,
      "Ġsever": 1157,
      "Ġthere": 1158,
      "based": 1159,
      "ĠUR": 1160,
      "Ġ[": 1161,
      "Ġno": 1162,
      "ater": 1163,
      "Ġavail": 1164,
      "Ġactivity": 1165,
      "een": 1166,
      "lement": 1167,
      "hod": 1168,
      "Ġgain": 1169,
      "ef": 1170,
      "ader": 1171,
      "Ġcurrent": 1172,
      "Ġmessage": 1173,
      "Ġknown": 1174,
      "rash": 1175,
      "ĠKore": 1176,
      "ues": 1177,
      "ators": 1178,
      "ï¿½ï¿½": 1179,
      "Ġcomputer": 1180,
      "Ġpublic": 1181,
      "ribut": 1182,
      "imate": 1183,
      "tructure": 1184,
      "Ġwebsite": 1185,
      "ploy": 1186,
      "ileg": 1187,
      "Ġright": 1188,
      "ative": 1189,
      "ĠHTTP": 1190,
      "Ġbec": 1191,
      "ily": 1192,
      "14": 1193,
      "ww": 1194,
      "Ġsupp": 1195,
      "ĠFor": 1196,
      "rojan": 1197,
      "Ġsend": 1198,
      "rastructure": 1199,
      "acle": 1200,
      "17": 1201,
      "ĠUnspecified": 1202,
      "other": 1203,
      "Ġocal": 1204,
      "Ġuses": 1205,
      "etween": 1206,
      "Ġanalysis": 1207,
      "Ġcustom": 1208,
      "ries": 1209,
      "Ġform": 1210,
      "Ġobserved": 1211,
      "Ġpossibly": 1212,
      "ark": 1213,
      "ample": 1214,
      "ava": 1215,
      "ĠOracle": 1216,
      "Ġmain": 1217,
      "llig": 1218,
      "Ġsaid": 1219,
      "oll": 1220,
      "Ġscripting": 1221,
      "lient": 1222,
      "dll": 1223,
      "28": 1224,
      "Ġincluding": 1225,
      "ics": 1226,
      "ilar": 1227,
      "ery": 1228,
      "ten": 1229,
      "sent": 1230,
      "Ġqu": 1231,
      "tempt": 1232,
      "ext": 1233,
      "Ġdevelop": 1234,
      "xt": 1235,
      "Ġcontains": 1236,
      "og": 1237,
      "Ġhigh": 1238,
      "Ġmethod": 1239,
      "ĠOn": 1240,
      "25": 1241,
      "Ġsuccess": 1242,
      "Ġprivileg": 1243,
      "ĠAd": 1244,
      "Ġattempt": 1245,
      "ize": 1246,
      "XSS": 1247,
      "Ġbetween": 1248,
      "Ġgener": 1249,
      "ĠGoogle": 1250,
      "Ġiss": 1251,
      "Ġvictims": 1252,
      "ally": 1253,
      "ET": 1254,
      "Ġpack": 1255,
      "ansom": 1256,
      "Ġopen": 1257,
      "Ġac": 1258,
      "ĠWe": 1259,
      "ym": 1260,
      "oded": 1261,
      "Ġste": 1262,
      "SA": 1263,
      "Ġseveral": 1264,
      "Ġcred": 1265,
      "Ġmem": 1266,
      "Ġph": 1267,
      "ob": 1268,
      "lligence": 1269,
      "Ġmon": 1270,
      "urce": 1271,
      "Ġgovernment": 1272,
      "Ġbeing": 1273,
      "Ġinfected": 1274,
      "Ġinit": 1275,
      "Ġinterest": 1276,
      "Ġcrash": 1277,
      "Ġexp": 1278,
      "Ġsent": 1279,
      "ĠSo": 1280,
      "Ġ:": 1281,
      "bers": 1282,
      "Ġconfiguration": 1283,
      "Ġoverf": 1284,
      "olog": 1285,
      "07": 1286,
      "ade": 1287,
      "ized": 1288,
      "27": 1289,
      "Ġprogram": 1290,
      "Ġstart": 1291,
      "ash": 1292,
      "ird": 1293,
      "ka": 1294,
      "igure": 1295,
      "ough": 1296,
      "Ġphishing": 1297,
      "Ġmany": 1298,
      "Ġdem": 1299,
      "rain": 1300,
      "OS": 1301,
      "itive": 1302,
      "Ġstring": 1303,
      "Ġleg": 1304,
      "24": 1305,
      "Ġme": 1306,
      "plor": 1307,
      "Ġvariant": 1308,
      "ĠPl": 1309,
      "eld": 1310,
      "Ġadministr": 1311,
      "ci": 1312,
      "ick": 1313,
      "Ġinfrastructure": 1314,
      "ĠURL": 1315,
      "Ġimpact": 1316,
      "Ġchec": 1317,
      "Ġbackdoor": 1318,
      "Ġdropp": 1319,
      "Ġconnect": 1320,
      "Ġdirectory": 1321,
      "ĠJava": 1322,
      "19": 1323,
      "Ġlikely": 1324,
      "Ġrights": 1325,
      "Ġransom": 1326,
      "Ġprevious": 1327,
      "Ġactors": 1328,
      "ĠChina": 1329,
      "OR": 1330,
      "Ġ''": 1331,
      "ĠDLL": 1332,
      "ves": 1333,
      "Ġbro": 1334,
      "ets": 1335,
      "ms": 1336,
      "Ġz": 1337,
      "put": 1338,
      "plorer": 1339,
      "Ġsimilar": 1340,
      "Ġafter": 1341,
      "Ġulnerability": 1342,
      "lish": 1343,
      "Ġext": 1344,
      "Ġarlier": 1345,
      "enc": 1346,
      "ete": 1347,
      "ĠMan": 1348,
      "Ġspecific": 1349,
      "Ġremote": 1350,
      "day": 1351,
      "als": 1352,
      "me": 1353,
      "Ġ=": 1354,
      "Ġcompany": 1355,
      "lear": 1356,
      "line": 1357,
      "Ġregistr": 1358,
      "ky": 1359,
      "Ġret": 1360,
      "ĠRussian": 1361,
      "Ġinj": 1362,
      "estig": 1363,
      "Ġsample": 1364,
      "Ġsuccessful": 1365,
      "Ġlarg": 1366,
      "Ġoperations": 1367,
      "Ġsens": 1368,
      "ie": 1369,
      "ited": 1370,
      "Ġbased": 1371,
      "king": 1372,
      "wn": 1373,
      "Th": 1374,
      "irus": 1375,
      "ĠComm": 1376,
      "Ġaffect": 1377,
      "Ġbin": 1378,
      "ently": 1379,
      "oint": 1380,
      "Ġcl": 1381,
      "ĠSh": 1382,
      "Ġdetails": 1383,
      "Ġins": 1384,
      "Ġ2013": 1385,
      "akes": 1386,
      "03": 1387,
      "ĠFire": 1388,
      "ruption": 1389,
      "Ġcap": 1390,
      "Ġyou": 1391,
      "Ġpath": 1392,
      "IN": 1393,
      "the": 1394,
      "09": 1395,
      "ator": 1396,
      "Ġaccounts": 1397,
      "Ġtra": 1398,
      "krain": 1399,
      "ared": 1400,
      "ernel": 1401,
      "ild": 1402,
      "Ġduring": 1403,
      "ored": 1404,
      "Ġport": 1405,
      "ield": 1406,
      "Ġdiscover": 1407,
      "23": 1408,
      "atch": 1409,
      "ible": 1410,
      "Ġoverflow": 1411,
      "Ġorganizations": 1412,
      "Ġint": 1413,
      "ility": 1414,
      "ran": 1415,
      "Ġaka": 1416,
      "mail": 1417,
      "eam": 1418,
      "ases": 1419,
      "Ġsecond": 1420,
      "AN": 1421,
      "Ġable": 1422,
      "Ġ2015": 1423,
      "pass": 1424,
      "Ġcase": 1425,
      "ull": 1426,
      "//": 1427,
      "ĠExplorer": 1428,
      "onse": 1429,
      "Ġadv": 1430,
      "Ġsensitive": 1431,
      "ĠOS": 1432,
      "dobe": 1433,
      "Ġi": 1434,
      "Ġdomains": 1435,
      "Ġfe": 1436,
      "Ġwebs": 1437,
      "ĠThese": 1438,
      "text": 1439,
      "Ġuthenticated": 1440,
      "asp": 1441,
      "Ġexample": 1442,
      "rigin": 1443,
      "Ġrece": 1444,
      "uke": 1445,
      "orth": 1446,
      "ower": 1447,
      "Ġresult": 1448,
      "ĠCon": 1449,
      "Ġwhere": 1450,
      "04": 1451,
      "ĠCross": 1452,
      "ique": 1453,
      "ĠLin": 1454,
      "old": 1455,
      "Ġencrypted": 1456,
      "Ġ12": 1457,
      "Ġbeh": 1458,
      "Ġdisc": 1459,
      "Ġass": 1460,
      "ps": 1461,
      "quire": 1462,
      "Ġimplement": 1463,
      "Ġcoll": 1464,
      "Ġload": 1465,
      "ĠTrojan": 1466,
      "Ġway": 1467,
      "plication": 1468,
      "Ġanother": 1469,
      "Ġidentified": 1470,
      "Ġinvol": 1471,
      "Ġstate": 1472,
      "Ġwebsites": 1473,
      "ause": 1474,
      "Ġversions": 1475,
      "ister": 1476,
      "ayer": 1477,
      "Ġvalue": 1478,
      "ice": 1479,
      "Ġmach": 1480,
      "ĠID": 1481,
      "Ġla": 1482,
      "sel": 1483,
      "Ġsee": 1484,
      "ĠUkrain": 1485,
      "ists": 1486,
      "ĠInte": 1487,
      "ĠAdobe": 1488,
      "round": 1489,
      "Ġbuffer": 1490,
      "Ġsite": 1491,
      "Ġcredential": 1492,
      "Ġcertain": 1493,
      "Ġlegit": 1494,
      "AR": 1495,
      "Ġpplication": 1496,
      "ĠMultiple": 1497,
      "ee": 1498,
      "Ġorder": 1499,
      "ually": 1500,
      "Ġboth": 1501,
      "Ġproduct": 1502,
      "ĠY": 1503,
      "Ġget": 1504,
      "soci": 1505,
      "Ġupdate": 1506,
      "ilit": 1507,
      "Ġpoint": 1508,
      "Ġsupport": 1509,
      "Ġlong": 1510,
      ".]": 1511,
      "Ġinvestig": 1512,
      "Ġassoci": 1513,
      "ĠĠĠĠ": 1514,
      "idd": 1515,
      "IS": 1516,
      "05": 1517,
      "Ġ|": 1518,
      "Ġprivileges": 1519,
      "33": 1520,
      "err": 1521,
      "med": 1522,
      "Ġpol": 1523,
      "ĠCyber": 1524,
      "06": 1525,
      "ionage": 1526,
      "[.]": 1527,
      "ĠOper": 1528,
      "Ġaddresses": 1529,
      "Ġperform": 1530,
      "Ġeff": 1531,
      "Ġclient": 1532,
      "Ġorigin": 1533,
      "igned": 1534,
      "Ġtrans": 1535,
      "Ġdecrypt": 1536,
      "Ġunder": 1537,
      "AP": 1538,
      "sh": 1539,
      "Ġlegitimate": 1540,
      "://": 1541,
      "Ġ2016": 1542,
      "Ġkernel": 1543,
      "ER": 1544,
      "Ġavailable": 1545,
      "Ġvis": 1546,
      "Ġfunctional": 1547,
      "Ġeng": 1548,
      "try": 1549,
      "Ġdist": 1550,
      "Ġnames": 1551,
      "Ġexecution": 1552,
      "ability": 1553,
      "lows": 1554,
      "ĠInd": 1555,
      "Ġexecutable": 1556,
      "ended": 1557,
      "ĠZ": 1558,
      "Ġadditional": 1559,
      "Ġrunning": 1560,
      "urn": 1561,
      "Ġinjection": 1562,
      "29": 1563,
      "Ġtargeting": 1564,
      "Ġcampaigns": 1565,
      "Ġrep": 1566,
      "Ġhard": 1567,
      "Ġseen": 1568,
      "ording": 1569,
      "000": 1570,
      "Ġexploits": 1571,
      "py": 1572,
      "Ġdocuments": 1573,
      "ĠAl": 1574,
      "ting": 1575,
      "Ġinitial": 1576,
      "ĠAr": 1577,
      "oz": 1578,
      "Ġrele": 1579,
      "Ġbypass": 1580,
      "ĠChinese": 1581,
      "lock": 1582,
      "ook": 1583,
      "Ġgroups": 1584,
      ",âĢĿ": 1585,
      "Ġ%": 1586,
      "Ġobject": 1587,
      "Ġshell": 1588,
      "Ġhow": 1589,
      "ĠAs": 1590,
      "Ġcontin": 1591,
      "ĠAnd": 1592,
      "âĢľ": 1593,
      "Ġcorruption": 1594,
      "ĠLinux": 1595,
      "ĠAct": 1596,
      "ugg": 1597,
      "onstr": 1598,
      "Ġred": 1599,
      "cept": 1600,
      "ĠRAT": 1601,
      "edia": 1602,
      "ines": 1603,
      "Ġmultiple": 1604,
      "tific": 1605,
      "Ġear": 1606,
      "Ġeach": 1607,
      "uch": 1608,
      "Ġfam": 1609,
      "eop": 1610,
      "Ġtake": 1611,
      "ero": 1612,
      "Ġ$": 1613,
      "Ġpage": 1614,
      "Ġbeli": 1615,
      "Ġanaly": 1616,
      "AC": 1617,
      "ault": 1618,
      "Ġ&": 1619,
      "Ġpossible": 1620,
      "ĠMac": 1621,
      "Ġcredentials": 1622,
      "Ġtraffic": 1623,
      "Ġreso": 1624,
      "Ġcommon": 1625,
      "Ġfin": 1626,
      "Ġpost": 1627,
      "ĠCont": 1628,
      "ĠIf": 1629,
      "agement": 1630,
      "isk": 1631,
      "pro": 1632,
      "Ġexploited": 1633,
      "Ġassociated": 1634,
      "08": 1635,
      "orld": 1636,
      "Ġcontact": 1637,
      "Ġbecause": 1638,
      "gy": 1639,
      "Ġfield": 1640,
      "ternal": 1641,
      "Ġdescri": 1642,
      "NS": 1643,
      "Ġnamed": 1644,
      "Ġpur": 1645,
      "vir": 1646,
      "Ġappears": 1647,
      "very": 1648,
      "Ġcomputers": 1649,
      "Ġquest": 1650,
      "Ġfunctionality": 1651,
      "Ġbelie": 1652,
      "Ġpartic": 1653,
      "Ġmight": 1654,
      "ĠApple": 1655,
      "iness": 1656,
      "Ġdemonstr": 1657,
      "Ġam": 1658,
      "Ġwar": 1659,
      "Ġsoc": 1660,
      "roll": 1661,
      "Ġrefer": 1662,
      "ital": 1663,
      "Ġconduct": 1664,
      "nam": 1665,
      "Ġwhat": 1666,
      "ĠUS": 1667,
      "ĠKorea": 1668,
      "Ġeven": 1669,
      "ents": 1670,
      "olut": 1671,
      "Ġtim": 1672,
      "Ġactor": 1673,
      "Ġreported": 1674,
      "ilitary": 1675,
      "Ġchar": 1676,
      "ax": 1677,
      "ology": 1678,
      "Ġend": 1679,
      "Ġaction": 1680,
      "Wh": 1681,
      "anies": 1682,
      "Ġinclude": 1683,
      "ĠNO": 1684,
      "ivid": 1685,
      "Ġhtt": 1686,
      "Ġsearch": 1687,
      "Ġesp": 1688,
      "Ġattach": 1689,
      "Ġlarge": 1690,
      "urther": 1691,
      "Ġemails": 1692,
      "Ġspecially": 1693,
      "itor": 1694,
      "tract": 1695,
      "ĠSystem": 1696,
      "ager": 1697,
      "ĠInf": 1698,
      "viron": 1699,
      "45": 1700,
      "SC": 1701,
      "Ġlook": 1702,
      "Duke": 1703,
      "ĠRussia": 1704,
      "Ġbre": 1705,
      "26": 1706,
      "Ġneed": 1707,
      "Ġ_": 1708,
      "Ġory": 1709,
      "app": 1710,
      "eople": 1711,
      "uthor": 1712,
      "vel": 1713,
      "ĠVulnerability": 1714,
      "Ġpr": 1715,
      "Ġshould": 1716,
      "St": 1717,
      "por": 1718,
      "Ġpot": 1719,
      "Ġservices": 1720,
      "Ġthird": 1721,
      "On": 1722,
      "org": 1723,
      "Ġfind": 1724,
      "Ġpatch": 1725,
      "Ġbinary": 1726,
      "ether": 1727,
      "Ġu": 1728,
      "Ġ2012": 1729,
      "bit": 1730,
      "Ġcertific": 1731,
      "Ġcompanies": 1732,
      "gin": 1733,
      "atform": 1734,
      "ugin": 1735,
      "Ġperson": 1736,
      "pe": 1737,
      "anced": 1738,
      "tes": 1739,
      "ector": 1740,
      "35": 1741,
      "Ġeas": 1742,
      "Ġdevices": 1743,
      "Ġview": 1744,
      "Ġrequire": 1745,
      "rame": 1746,
      "ted": 1747,
      "ï¬": 1748,
      "Ġaffected": 1749,
      "Ġpresent": 1750,
      "lash": 1751,
      "ffice": 1752,
      "usiness": 1753,
      "Ġ2011": 1754,
      "ules": 1755,
      "Ġpotential": 1756,
      "Ġvery": 1757,
      "idence": 1758,
      "CP": 1759,
      "ier": 1760,
      "Ġintelligence": 1761,
      "Ġregistry": 1762,
      "cial": 1763,
      "eng": 1764,
      "Ġ17": 1765,
      "Ġoperation": 1766,
      "ividual": 1767,
      "Ġcount": 1768,
      "Ġsource": 1769,
      "ik": 1770,
      "Ġthose": 1771,
      "urces": 1772,
      "Ġidentify": 1773,
      "fil": 1774,
      "uc": 1775,
      "Ġbrows": 1776,
      "aries": 1777,
      "Ġsimp": 1778,
      "LE": 1779,
      "aj": 1780,
      "con": 1781,
      "name": 1782,
      "Ġprob": 1783,
      "Ġthree": 1784,
      "isco": 1785,
      "Ġlater": 1786,
      "Ġleast": 1787,
      "Ġlast": 1788,
      "Ġincident": 1789,
      "Ġupload": 1790,
      "....": 1791,
      "Ġfeature": 1792,
      "ĠUp": 1793,
      "Ġupd": 1794,
      "ell": 1795,
      "Ġsuccessfully": 1796,
      "Ġransomware": 1797,
      "ĠNOTE": 1798,
      "Ġtrig": 1799,
      "Ġsection": 1800,
      "Ġregister": 1801,
      "aking": 1802,
      "Ġreceiv": 1803,
      "ather": 1804,
      "Ġ2008": 1805,
      "ool": 1806,
      "Ġresponse": 1807,
      "Ġdiscovered": 1808,
      "roid": 1809,
      "uggest": 1810,
      "ention": 1811,
      "ving": 1812,
      "Ġsteal": 1813,
      "ĠHowever": 1814,
      "its": 1815,
      "ured": 1816,
      "ocus": 1817,
      "Ġparticular": 1818,
      "Ġdeli": 1819,
      "CS": 1820,
      "Ġlever": 1821,
      "Ġsuggest": 1822,
      "ately": 1823,
      "oy": 1824,
      "atab": 1825,
      "Ġactive": 1826,
      "Ġindividual": 1827,
      "Ġvalid": 1828,
      "Ġreve": 1829,
      "Ġcreated": 1830,
      "self": 1831,
      "02": 1832,
      "ID": 1833,
      "loud": 1834,
      "Ġmade": 1835,
      "Ġsince": 1836,
      "file": 1837,
      "Ġnetworks": 1838,
      "Ġown": 1839,
      "Ġmilitary": 1840,
      "ersky": 1841,
      "ĠNorth": 1842,
      "ON": 1843,
      "aspersky": 1844,
      "ye": 1845,
      "Ġcreate": 1846,
      "istic": 1847,
      "oot": 1848,
      "lob": 1849,
      "ĠWin": 1850,
      "Ġcommunication": 1851,
      "Ġerr": 1852,
      "Ġ19": 1853,
      "Ġintegr": 1854,
      "Ġresearchers": 1855,
      "rome": 1856,
      "ective": 1857,
      "ĠFigure": 1858,
      "Ġextens": 1859,
      "MS": 1860,
      "ĠNetwork": 1861,
      "Ġcalled": 1862,
      "af": 1863,
      "ocol": 1864,
      "37": 1865,
      "Ġter": 1866,
      "Ġmake": 1867,
      "Ġcases": 1868,
      "Âł": 1869,
      "red": 1870,
      "âĢĿ.": 1871,
      "raph": 1872,
      "xx": 1873,
      "Ġhel": 1874,
      "Ġlocal": 1875,
      "Ġreal": 1876,
      "Ġyears": 1877,
      "ttack": 1878,
      "ĠOffice": 1879,
      "miss": 1880,
      "Ġaut": 1881,
      "ense": 1882,
      "idential": 1883,
      "34": 1884,
      "It": 1885,
      "Ġwrit": 1886,
      "abled": 1887,
      "Ġcreat": 1888,
      "Ġmessages": 1889,
      "Ġissue": 1890,
      "36": 1891,
      "ĠThreat": 1892,
      "Ġfact": 1893,
      "ures": 1894,
      "Ġccess": 1895,
      "Ġdriver": 1896,
      "Ġkn": 1897,
      "tead": 1898,
      "of": 1899,
      "usion": 1900,
      "Ġpreviously": 1901,
      "Ġant": 1902,
      "Ġappear": 1903,
      "unch": 1904,
      "Ġstill": 1905,
      "Ġwhile": 1906,
      "Ġsites": 1907,
      "Ġvar": 1908,
      "Ġexecute": 1909,
      "Ġhttp": 1910,
      "ï¿½ï¿½ï¿½ï¿½": 1911,
      "Ġmemory": 1912,
      "Ġdid": 1913,
      "ĠGroup": 1914,
      "Ġfew": 1915,
      "Ġlib": 1916,
      "Ġ15": 1917,
      "Ġyour": 1918,
      "Ġban": 1919,
      "ĠCisco": 1920,
      "ĠAndroid": 1921,
      "ES": 1922,
      "wit": 1923,
      "los": 1924,
      "ĠWord": 1925,
      "Ġitself": 1926,
      "vironment": 1927,
      "ge": 1928,
      "ij": 1929,
      "Ġemploy": 1930,
      "38": 1931,
      "ged": 1932,
      "aka": 1933,
      "prise": 1934,
      "Ġmachine": 1935,
      "work": 1936,
      "Ġengine": 1937,
      "Ġincre": 1938,
      ".âĢĿ": 1939,
      "01": 1940,
      "Ġconc": 1941,
      "ateg": 1942,
      "ĠChrome": 1943,
      "lished": 1944,
      "Ġdemonstrated": 1945,
      "Ġel": 1946,
      "Ġdesigned": 1947,
      "ï¬ģ": 1948,
      "Ġsm": 1949,
      "rite": 1950,
      "Ġhowever": 1951,
      "illa": 1952,
      "Ġcross": 1953,
      "usp": 1954,
      "par": 1955,
      "ering": 1956,
      "Ġembed": 1957,
      "Ġdevice": 1958,
      "Ġconnection": 1959,
      "Ġ14": 1960,
      "Ġchang": 1961,
      "ĠUkraine": 1962,
      "22": 1963,
      "ĠQ": 1964,
      "Ġcheck": 1965,
      "Ġwithout": 1966,
      "Ġdetection": 1967,
      "Ġmakes": 1968,
      "olen": 1969,
      "Ġbytes": 1970,
      "ĠAPI": 1971,
      "Ġdropper": 1972,
      "ts": 1973,
      "Ġexecuted": 1974,
      "Ġworld": 1975,
      "Ġfull": 1976,
      "Ġapplication": 1977,
      "atic": 1978,
      "aged": 1979,
      "Ġcompromise": 1980,
      "Ġhackers": 1981,
      "30": 1982,
      "Ġclear": 1983,
      "aging": 1984,
      "Ġplugin": 1985,
      "Ġbreach": 1986,
      "Ġcontaining": 1987,
      "Ġshow": 1988,
      "az": 1989,
      "xy": 1990,
      "Ġmin": 1991,
      "enter": 1992,
      "Ġ2010": 1993,
      "ty": 1994,
      "ĠOperation": 1995,
      "44": 1996,
      "Ġblock": 1997,
      "Ġfocus": 1998,
      "ask": 1999,
      "Ġhash": 2000,
      "Ġimport": 2001,
      "ĠDec": 2002,
      "ĠUs": 2003,
      "ĠInc": 2004,
      "ype": 2005,
      "Ġrecord": 2006,
      "Ġobtained": 2007,
      "ajor": 2008,
      "Ġimage": 2009,
      "Ġintegrity": 2010,
      "Ġdetect": 2011,
      "Ġtechnical": 2012,
      "ĠAll": 2013,
      "Ġinstalled": 2014,
      "ĠRes": 2015,
      "Ġprim": 2016,
      "Ġprovide": 2017,
      "fus": 2018,
      "ĠÂ": 2019,
      "Ġcri": 2020,
      "fox": 2021,
      "Ġteam": 2022,
      "ĠOpen": 2023,
      "Ġpersist": 2024,
      "Pro": 2025,
      "att": 2026,
      "alware": 2027,
      "Ġvarious": 2028,
      "Ġsel": 2029,
      "Ġshows": 2030,
      "Ġrout": 2031,
      "ded": 2032,
      "ĠDirect": 2033,
      "Ġoften": 2034,
      "uly": 2035,
      "Ġespionage": 2036,
      "ences": 2037,
      "Ġbelow": 2038,
      "ably": 2039,
      "Ġinfect": 2040,
      "Ġspear": 2041,
      "Ġclic": 2042,
      "rie": 2043,
      "ĠComp": 2044,
      "ĠLab": 2045,
      "Ġplatform": 2046,
      "ither": 2047,
      "Ġstolen": 2048,
      "io": 2049,
      "ĠDNS": 2050,
      "Ġlead": 2051,
      "48": 2052,
      "igital": 2053,
      "Ġerror": 2054,
      "ĠSp": 2055,
      "Ġexist": 2056,
      "Ġstage": 2057,
      "Ġrisk": 2058,
      "ĠActive": 2059,
      "Ġest": 2060,
      "Ġchange": 2061,
      "Ġcontained": 2062,
      "Ġmedia": 2063,
      "iques": 2064,
      "Ġcompl": 2065,
      "OC": 2066,
      "Ġut": 2067,
      "IP": 2068,
      "reen": 2069,
      "ĠIran": 2070,
      "Ġtype": 2071,
      "ety": 2072,
      "laim": 2073,
      "Ġdefault": 2074,
      "Ġencryption": 2075,
      "atabase": 2076,
      "Ġstored": 2077,
      "Ġorganization": 2078,
      "Ġoffic": 2079,
      "code": 2080,
      "Ġproducts": 2081,
      "Ġanalyz": 2082,
      "Ġblog": 2083,
      "Ġgiv": 2084,
      "ĠFlash": 2085,
      "lack": 2086,
      "acking": 2087,
      "Ġcountries": 2088,
      "Ġ#": 2089,
      "We": 2090,
      "Ġrespons": 2091,
      "ĠTr": 2092,
      "antec": 2093,
      "Ġshown": 2094,
      "ymantec": 2095,
      "ivers": 2096,
      "Ġattribut": 2097,
      "Ġinfection": 2098,
      "Ġaddition": 2099,
      "ĠFirefox": 2100,
      "ĠAttack": 2101,
      "Ġhandle": 2102,
      "Ġknow": 2103,
      "iddle": 2104,
      "Com": 2105,
      "ĠSe": 2106,
      "ĠUpdate": 2107,
      "Ġmonth": 2108,
      "ĠSouth": 2109,
      ",\"": 2110,
      "RE": 2111,
      "Ġconfidential": 2112,
      "ward": 2113,
      "ĠMarch": 2114,
      "Ġcomponents": 2115,
      "Ġevidence": 2116,
      "ency": 2117,
      "ozilla": 2118,
      "BM": 2119,
      "Ġonline": 2120,
      "Ġdeploy": 2121,
      "Ġprovided": 2122,
      "Ġlaunch": 2123,
      "by": 2124,
      "Ġ+": 2125,
      "lease": 2126,
      "Ġcorre": 2127,
      "39": 2128,
      "Ġmajor": 2129,
      "une": 2130,
      "vert": 2131,
      "Ġadvers": 2132,
      "ĠWhile": 2133,
      "ling": 2134,
      "Ġ*": 2135,
      "ĠPower": 2136,
      "fusc": 2137,
      "Ġindex": 2138,
      "ai": 2139,
      "rend": 2140,
      "Ġinteresting": 2141,
      "Ġlevel": 2142,
      "Ġsusp": 2143,
      "Ġunique": 2144,
      "Ġdeter": 2145,
      "Ġyear": 2146,
      "Ġstructure": 2147,
      "Ġworking": 2148,
      "Ġfix": 2149,
      "Ġconv": 2150,
      "Ġsignific": 2151,
      "Ġjust": 2152,
      "47": 2153,
      "strict": 2154,
      "NET": 2155,
      "Ġcompil": 2156,
      "Ġcoun": 2157,
      "Ġappro": 2158,
      "Ġremain": 2159,
      "mit": 2160,
      "Ġfurther": 2161,
      "row": 2162,
      "ables": 2163,
      "Ġstrings": 2164,
      "Ġtechniques": 2165,
      "ĠAg": 2166,
      "abilities": 2167,
      "HP": 2168,
      "Ġocc": 2169,
      "Ġevery": 2170,
      "Ġseem": 2171,
      "lex": 2172,
      "Ġvariants": 2173,
      "Ġclass": 2174,
      "Ġpurp": 2175,
      "Ġsocial": 2176,
      "Ġfla": 2177,
      "46": 2178,
      "lications": 2179,
      "ined": 2180,
      "ider": 2181,
      "Ġcontext": 2182,
      "ns": 2183,
      "inks": 2184,
      "Ġparty": 2185,
      "ĠMS": 2186,
      "Ġless": 2187,
      "ĠJuly": 2188,
      "Ġvalues": 2189,
      "Ġdescribed": 2190,
      "Ġintended": 2191,
      "mp": 2192,
      "Ġpa": 2193,
      "Ġdistribut": 2194,
      "ĠMay": 2195,
      "irt": 2196,
      "ands": 2197,
      "Ġhelp": 2198,
      "Ġclaim": 2199,
      "Ġrev": 2200,
      "Ġfunctions": 2201,
      "Ġlisted": 2202,
      "inf": 2203,
      "Ġincluded": 2204,
      "Ġbehind": 2205,
      "Ġembedded": 2206,
      "ramework": 2207,
      "Ġprotocol": 2208,
      "Ġtest": 2209,
      "Ġcrit": 2210,
      "Ġcapabilities": 2211,
      "Ġpolit": 2212,
      "uro": 2213,
      "Ġintr": 2214,
      "Ġexper": 2215,
      "Ġreturn": 2216,
      "earch": 2217,
      "Ġsur": 2218,
      "Ġpop": 2219,
      "Ġoperating": 2220,
      "'t": 2221,
      "ĠKorean": 2222,
      "ĠSS": 2223,
      "ĠManager": 2224,
      "inter": 2225,
      "ĠBe": 2226,
      "Ġrecent": 2227,
      "IT": 2228,
      "Ġzero": 2229,
      "Ġsignificant": 2230,
      "Ġnon": 2231,
      "Ġaround": 2232,
      "acter": 2233,
      "ĠMozilla": 2234,
      "Ġ16": 2235,
      "phistic": 2236,
      "Ġmodules": 2237,
      "Ġabove": 2238,
      "obile": 2239,
      "Ġtext": 2240,
      "Ġpacket": 2241,
      "ĠIBM": 2242,
      "Ġacross": 2243,
      "ĠControl": 2244,
      "Ġbrowser": 2245,
      "face": 2246,
      "Ġattempts": 2247,
      "Ġautom": 2248,
      "ready": 2249,
      "ued": 2250,
      "though": 2251,
      "angu": 2252,
      "Kit": 2253,
      "ĠWhen": 2254,
      "Ġimplementation": 2255,
      "Ġbusiness": 2256,
      "ancial": 2257,
      "Ġdeliver": 2258,
      "Ġheader": 2259,
      "ĠHe": 2260,
      "Ġnow": 2261,
      "Re": 2262,
      "ĠFin": 2263,
      "ization": 2264,
      "Ġroot": 2265,
      "ler": 2266,
      "49": 2267,
      "Ġrestrict": 2268,
      "Ġbelieve": 2269,
      "acy": 2270,
      "âĢĿ,": 2271,
      "56": 2272,
      "Eye": 2273,
      "Ġregistered": 2274,
      "Ġtypically": 2275,
      "na": 2276,
      "for": 2277,
      "Ġ<": 2278,
      "resent": 2279,
      "Ġdirectly": 2280,
      "Ġcustomers": 2281,
      "Ġvisit": 2282,
      "ĠFile": 2283,
      "AS": 2284,
      "Ġ18": 2285,
      "ock": 2286,
      "Ġoriginal": 2287,
      "lobal": 2288,
      "IR": 2289,
      "tings": 2290,
      "Ġmuch": 2291,
      "Ġ13": 2292,
      "ĠPlayer": 2293,
      "ĠAfter": 2294,
      "Ġlinks": 2295,
      "usted": 2296,
      "ports": 2297,
      "Ġreceived": 2298,
      "man": 2299,
      "ĠXOR": 2300,
      "Ġconfidentiality": 2301,
      "key": 2302,
      "ternational": 2303,
      "Ġresources": 2304,
      "ĠDu": 2305,
      "ĠUse": 2306,
      "Ġshare": 2307,
      "de": 2308,
      "Ġeither": 2309,
      "Ġalready": 2310,
      "Ġinvestigation": 2311,
      "ĠMin": 2312,
      "86": 2313,
      "kit": 2314,
      "âĢĶ": 2315,
      "Ġallows": 2316,
      "Ġcertificate": 2317,
      "AD": 2318,
      "Ġfirm": 2319,
      "andom": 2320,
      "21": 2321,
      "41": 2322,
      "ert": 2323,
      "ĠAdd": 2324,
      "point": 2325,
      "ath": 2326,
      "MP": 2327,
      "ĠSymantec": 2328,
      "ĠPHP": 2329,
      "ĠData": 2330,
      "Ġprocesses": 2331,
      "Ġformat": 2332,
      "Ġcontroll": 2333,
      "50": 2334,
      "set": 2335,
      "osed": 2336,
      "ĠRSA": 2337,
      "Ġmeans": 2338,
      "Ġadministrative": 2339,
      "Ġconfigured": 2340,
      "Ġauthor": 2341,
      "pplication": 2342,
      "Ġthreats": 2343,
      "59": 2344,
      "ey": 2345,
      "Ex": 2346,
      "ek": 2347,
      "Ġmust": 2348,
      "ances": 2349,
      "ĠDe": 2350,
      "ĠJan": 2351,
      "Ġincludes": 2352,
      "Ġredirect": 2353,
      "stant": 2354,
      "ĠEnter": 2355,
      "hot": 2356,
      "inc": 2357,
      "Ġresol": 2358,
      "Ġmonitor": 2359,
      "Ġdate": 2360,
      "ober": 2361,
      "Ġsize": 2362,
      "epend": 2363,
      "ĠOne": 2364,
      "uxnet": 2365,
      "ĠInformation": 2366,
      "Ġbuild": 2367,
      "ĠFeb": 2368,
      "Ġdetected": 2369,
      "www": 2370,
      "Ġhij": 2371,
      "irtual": 2372,
      "Ġsophistic": 2373,
      "ls": 2374,
      "ĠService": 2375,
      "LP": 2376,
      "ah": 2377,
      "coded": 2378,
      "Ġenvironment": 2379,
      "Ġactivities": 2380,
      "light": 2381,
      "Ġbegin": 2382,
      "echan": 2383,
      "Ġdelet": 2384,
      "Ġprograms": 2385,
      "Ġfail": 2386,
      "less": 2387,
      "mer": 2388,
      "Ġpasswords": 2389,
      "ron": 2390,
      "ĠOct": 2391,
      "Ġ2017": 2392,
      "Ġavailability": 2393,
      "Ġobfusc": 2394,
      "minal": 2395,
      "Ġlocated": 2396,
      "For": 2397,
      "ĠDef": 2398,
      "ength": 2399,
      "Ġcopy": 2400,
      "Ġarch": 2401,
      "ĠUnited": 2402,
      "Ġestab": 2403,
      "Ġwritten": 2404,
      "Ġreveal": 2405,
      "Ġfore": 2406,
      "ĠDr": 2407,
      "ĠWebKit": 2408,
      "Ġmethods": 2409,
      "Ġeffort": 2410,
      "air": 2411,
      "ynam": 2412,
      "Ġconnections": 2413,
      "Ġgu": 2414,
      "Ġprovides": 2415,
      "Ġpublicly": 2416,
      "Script": 2417,
      "Ġfake": 2418,
      "ĠCSC": 2419,
      "ustry": 2420,
      "Ġwhether": 2421,
